Tekla Open API Reference for Tekla Structures 2025
SecondaryTypeAttribute.Type Property
 The custom attribute [SecondaryType()] uses this to store the secondary type to the system. This is not to be used by itself.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectionBase.SecondaryType Type { get; }
Public ReadOnly Property Type As ConnectionBase.SecondaryType
	Get
Property Value
Type: ConnectionBase.SecondaryType
See Also
Reference
SecondaryTypeAttribute Class
Tekla.Structures.Plugins Namespace